In [1]:
import pandas as pd

In [13]:
df = pd.read_csv("sales_data_sample (1).csv",encoding = "latin1")
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [44]:
df.tail()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,PHONE,ADDRESSLINE1,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,(91) 555 94 44,"C/ Moralzarzal, 86",Madrid,CA,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,981-443655,Torikatu 38,Oulu,CA,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,(91) 555 94 44,"C/ Moralzarzal, 86",Madrid,CA,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,61.77.6555,1 rue Alsace-Lorraine,Toulouse,CA,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,6175559555,8616 Spinnaker Dr.,Boston,MA,51003,USA,CA,Yoshido,Juri,Medium

In [45]:
df.sample(5)

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,PHONE,ADDRESSLINE1,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
1116,10126,38,82.34,16,3128.92,5/28/2003 0:00,Shipped,2,5,2003,...,(91) 555 22 82,"C/ Araquil, 67",Madrid,CA,28023,Spain,EMEA,Sommer,Mart¡n,Medium
189,10142,33,100.00,12,8023.29,8/8/2003 0:00,Shipped,3,8,2003,...,4155551450,5677 Strong St.,San Rafael,CA,97562,USA,CA,Nelson,Valarie,Large
2548,10283,20,94.14,2,1882.80,8/20/2004 0:00,Shipped,3,8,2004,...,(604) 555-4555,23 Tsawassen Blvd.,Tsawassen,BC,T2F 8M4,Canada,CA,Lincoln,Elizabeth,Small
2471,10273,21,65.34,7,1372.14,7/21/2004 0:00,Shipped,3,7,2004,...,(02) 5554 67,Rue Joseph-Bens 532,Bruxelles,CA,B-1180,Belgium,EMEA,Dewey,Catherine,Small
557,10167,43,100.00,1,5763.72,10/23/2003 0:00,Cancelled,4,10,2003,...,0695-34 6555,?kergatan 24,Boras,CA,S-844 67,Sweden,EMEA,Larsson,Maria,Medium

In [46]:
df.shape

(2823, 24)

In [47]:
df.size

67752

In [48]:
df.columns

Index(['ORDERNUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'QTR_ID', 'MONTH_ID', 'YEAR_ID',
       'PRODUCTLINE', 'MSRP', 'PRODUCTCODE', 'CUSTOMERNAME', 'PHONE',
       'ADDRESSLINE1', 'CITY', 'STATE', 'POSTALCODE', 'COUNTRY', 'TERRITORY',
       'CONTACTLASTNAME', 'CONTACTFIRSTNAME', 'DEALSIZE'],
      dtype='object')

In [49]:
df.index

RangeIndex(start=0, stop=2823, step=1)

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2823 entries, 0 to 2822
Data columns (total 24 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ORDERNUMBER       2823 non-null   int64
 1   QUANTITYORDERED   2823 non-null   int64
 2   PRICEEACH         2823 non-null   float64
 3   ORDERLINENUMBER   2823 non-null   int64
 4   SALES             2823 non-null   float64
 5   ORDERDATE         2823 non-null   object
 6   STATUS            2823 non-null   object
 7   QTR_ID            2823 non-null   int64
 8   MONTH_ID          2823 non-null   int64
 9   YEAR_ID           2823 non-null   int64
 10  PRODUCTLINE       2823 non-null   object
 11  MSRP              2823 non-null   int64
 12  PRODUCTCODE       2823 non-null   object
 13  CUSTOMERNAME      2823 non-null   object
 14  PHONE             2823 non-null   object
 15  ADDRESSLINE1      2823 non-null   object
 16  CITY              2823 non-null   object
 17  STATE             2823 non-null   object
 18  POSTALCODE        2823 non-null   object
 19  COUNTRY           2823 non-null   object
 20  TERRITORY         2823 non-null   object
 21  CONTACTLASTNAME   2823 non-null   object
 22  CONTACTFIRSTNAME  2823 non-null   object
 23  DEALSIZE          2823 non-null   object
dtypes: float64(2), int64(7), object(15)
memory usage: 529.4+ KB

In [51]:
df.describe()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,QTR_ID,MONTH_ID,YEAR_ID,MSRP
count,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.00000,2823.000000
mean,10258.725115,35.092809,83.658544,6.466171,3553.889072,2.717676,7.092455,2003.81509,100.715551
std,92.085478,9.741443,20.174277,4.225841,1841.865106,1.203878,3.656633,0.69967,40.187912
min,10100.000000,6.000000,26.880000,1.000000,482.130000,1.000000,1.000000,2003.00000,33.000000
25%,10180.000000,27.000000,68.860000,3.000000,2203.430000,2.000000,4.000000,2003.00000,68.000000
50%,10262.000000,35.000000,95.700000,6.000000,3184.800000,3.000000,8.000000,2004.00000,99.000000
75%,10333.500000,43.000000,100.000000,9.000000,4508.000000,4.000000,11.000000,2004.00000,124.000000
max,10425.000000,97.000000,100.000000,18.000000,14082.800000,4.000000,12.000000,2005.00000,214.000000

In [52]:
df['COUNTRY'].unique()

array(['USA', 'France', 'Norway', 'Australia', 'Finland', 'Austria', 'UK',
       'Spain', 'Sweden', 'Singapore', 'Canada', 'Japan', 'Italy',
       'Denmark', 'Belgium', 'Philippines', 'Germany', 'Switzerland',
       'Ireland'], dtype=object)

In [53]:
df['STATUS'].value_counts()

STATUS
Shipped       2617
Cancelled       60
Resolved        47
On Hold         44
In Process      41
Disputed        14
Name: count, dtype: int64

In [54]:
df['DEALSIZE'].value_counts()

DEALSIZE
Medium    1384
Small     1282
Large      157
Name: count, dtype: int64

In [55]:
df.dtypes

ORDERNUMBER           int64
QUANTITYORDERED       int64
PRICEEACH           float64
ORDERLINENUMBER       int64
SALES               float64
ORDERDATE            object
STATUS               object
QTR_ID                int64
MONTH_ID              int64
YEAR_ID               int64
PRODUCTLINE          object
MSRP                  int64
PRODUCTCODE          object
CUSTOMERNAME         object
PHONE                object
ADDRESSLINE1         object
CITY                 object
STATE                object
POSTALCODE           object
COUNTRY              object
TERRITORY            object
CONTACTLASTNAME      object
CONTACTFIRSTNAME     object
DEALSIZE             object
dtype: object

In [56]:
df.select_dtypes(include = 'number')

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,QTR_ID,MONTH_ID,YEAR_ID,MSRP
0,10107,30,95.70,2,2871.00,1,2,2003,95
1,10121,34,81.35,5,2765.90,2,5,2003,95
2,10134,41,94.74,2,3884.34,3,7,2003,95
3,10145,45,83.26,6,3746.70,3,8,2003,95
4,10159,49,100.00,14,5205.27,4,10,2003,95
...,...,...,...,...,...,...,...,...,...
2818,10350,20,100.00,15,2244.40,4,12,2004,54
2819,10373,29,100.00,1,3978.51,1,1,2005,54
2820,10386,43,100.00,4,5417.57,1,3,2005,54
2821,10397,34,62.24,1,2116.16,1,3,2005,54
2822,10414,47,65.52,9,3079.44,2,5,2005,54

In [57]:
df.select_dtypes(include = 'object')

,ORDERDATE,STATUS,PRODUCTLINE,PRODUCTCODE,CUSTOMERNAME,PHONE,ADDRESSLINE1,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,2/24/2003 0:00,Shipped,Motorcycles,S10_1678,Land of Toys Inc.,2125557818,897 Long Airport Avenue,NYC,NY,10022,USA,CA,Yu,Kwai,Small
1,5/7/2003 0:00,Shipped,Motorcycles,S10_1678,Reims Collectables,26.47.1555,59 rue de l'Abbaye,Reims,CA,51100,France,EMEA,Henriot,Paul,Small
2,7/1/2003 0:00,Shipped,Motorcycles,S10_1678,Lyon Souveniers,+33 1 46 62 7555,27 rue du Colonel Pierre Avia,Paris,CA,75508,France,EMEA,Da Cunha,Daniel,Medium
3,8/25/2003 0:00,Shipped,Motorcycles,S10_1678,Toys4GrownUps.com,6265557265,78934 Hillside Dr.,Pasadena,CA,90003,USA,CA,Young,Julie,Medium
4,10/10/2003 0:00,Shipped,Motorcycles,S10_1678,Corporate Gift Ideas Co.,6505551386,7734 Strong St.,San Francisco,CA,CA,USA,CA,Brown,Julie,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,12/2/2004 0:00,Shipped,Ships,S72_3212,Euro Shopping Channel,(91) 555 94 44,"C/ Moralzarzal, 86",Madrid,CA,28034,Spain,EMEA,Freyre,Diego,Small
2819,1/31/2005 0:00,Shipped,Ships,S72_3212,"Oulu Toy Supplies, Inc.",981-443655,Torikatu 38,Oulu,CA,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,3/1/2005 0:00,Resolved,Ships,S72_3212,Euro Shopping Channel,(91) 555 94 44,"C/ Moralzarzal, 86",Madrid,CA,28034,Spain,EMEA,Freyre,Diego,Medium
2821,3/28/2005 0:00,Shipped,Ships,S72_3212,Alpha Cognac,61.77.6555,1 rue Alsace-Lorraine,Toulouse,CA,31000,France,EMEA,Roulet,Annette,Small
2822,5/6/2005 0:00,On Hold,Ships,S72_3212,Gifts4AllAges.com,6175559555,8616 Spinnaker Dr.,Boston,MA,51003,USA,CA,Yoshido,Juri,Medium

In [58]:
df['ORDERDATE'] = pd.to_datetime(df['ORDERDATE'])

In [59]:
df['POSTALCODE'] = df['POSTALCODE'].astype('string')

In [60]:
df['SALES']

0       2871.00
1       2765.90
2       3884.34
3       3746.70
4       5205.27
         ...
2818    2244.40
2819    3978.51
2820    5417.57
2821    2116.16
2822    3079.44
Name: SALES, Length: 2823, dtype: float64

In [61]:
df[['SALES','COUNTRY','YEAR_ID']]

        SALES  COUNTRY  YEAR_ID
0     2871.00      USA     2003
1     2765.90   France     2003
2     3884.34   France     2003
3     3746.70      USA     2003
4     5205.27      USA     2003
...       ...      ...      ...
2818  2244.40    Spain     2004
2819  3978.51  Finland     2005
2820  5417.57    Spain     2005
2821  2116.16   France     2005
2822  3079.44      USA     2005

[2823 rows x 3 columns]

In [62]:
#Rename columns
df.rename(columns = {'SALES':'TOTAL_SALES'},inplace = True)

In [67]:
#drop columns
#df.drop(columns = ['ADDRESSLINE2'],inplace = True)

In [68]:
#select rows
df.loc[0]
df.iloc[0:5]

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,TOTAL_SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,PHONE,ADDRESSLINE1,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2003-02-24,Shipped,1,2,2003,...,2125557818,897 Long Airport Avenue,NYC,NY,10022,USA,CA,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,2003-05-07,Shipped,2,5,2003,...,26.47.1555,59 rue de l'Abbaye,Reims,CA,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,2003-07-01,Shipped,3,7,2003,...,+33 1 46 62 7555,27 rue du Colonel Pierre Avia,Paris,CA,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,2003-08-25,Shipped,3,8,2003,...,6265557265,78934 Hillside Dr.,Pasadena,CA,90003,USA,CA,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,2003-10-10,Shipped,4,10,2003,...,6505551386,7734 Strong St.,San Francisco,CA,CA,USA,CA,Brown,Julie,Medium

In [70]:
#Conditional filtering
df[df['COUNTRY'] == 'USA']
df[df['TOTAL_SALES'] > 5000]
df[(df['YEAR_ID'] == 2004) & (df['DEALSIZE'] == 'Large')]

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,TOTAL_SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,PHONE,ADDRESSLINE1,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
20,10341,41,100.0,9,7737.93,2004-11-24,Shipped,4,11,2004,...,6562-9555,Geislweg 14,Salzburg,CA,5020,Austria,EMEA,Pipps,Georg,Large
39,10258,32,100.0,6,7680.64,2004-06-15,Shipped,2,6,2004,...,+81 3 3584 0555,2-2-8 Roppongi,Minato-ku,Tokyo,106-0032,Japan,Japan,Shimamura,Akiko,Large
41,10280,34,100.0,2,8014.82,2004-08-17,Shipped,3,8,2004,...,011-4988555,Via Monte Bianco 34,Torino,CA,10100,Italy,EMEA,Accorti,Paolo,Large
42,10291,37,100.0,11,7136.19,2004-09-08,Shipped,3,9,2004,...,0695-34 6555,?kergatan 24,Boras,CA,S-844 67,Sweden,EMEA,Larsson,Maria,Large
43,10304,47,100.0,6,10172.70,2004-10-11,Shipped,4,10,2004,...,30.59.8555,"67, avenue de l'Europe",Versailles,CA,78000,France,EMEA,Tonini,Daniel,Large
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1839,10339,55,100.0,13,10758.00,2004-11-23,Shipped,4,11,2004,...,+81 3 3584 0555,2-2-8 Roppongi,Minato-ku,Tokyo,106-0032,Japan,Japan,Shimamura,Akiko,Large
2241,10325,38,100.0,3,8844.12,2004-11-05,Shipped,4,11,2004,...,07-98 9555,Erling Skakkes gate 78,Stavern,CA,4110,Norway,EMEA,Bergulfsen,Jonas,Large
2295,10324,48,100.0,4,8209.44,2004-11-05,Shipped,4,11,2004,...,2125551500,2678 Kingston Rd.,NYC,NY,10022,USA,CA,Frick,Michael,Large
2634,10336,46,100.0,2,9558.80,2004-11-20,Shipped,4,11,2004,...,(1) 42.34.2555,"265, boulevard Charonne",Paris,CA,75012,France,EMEA,Bertrand,Marie,Large
2656,10318,50,100.0,8,7119.00,2004-11-02,Shipped,4,11,2004,...,2155551555,7586 Pompton St.,Allentown,PA,70267,USA,CA,Yu,Kyung,Large

In [71]:
df.isnull()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,TOTAL_SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,PHONE,ADDRESSLINE1,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2819,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2820,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2821,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2822,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [72]:
df.isnull().sum()

ORDERNUMBER         0
QUANTITYORDERED     0
PRICEEACH           0
ORDERLINENUMBER     0
TOTAL_SALES         0
ORDERDATE           0
STATUS              0
QTR_ID              0
MONTH_ID            0
YEAR_ID             0
PRODUCTLINE         0
MSRP                0
PRODUCTCODE         0
CUSTOMERNAME        0
PHONE               0
ADDRESSLINE1        0
CITY                0
STATE               0
POSTALCODE          0
COUNTRY             0
TERRITORY           0
CONTACTLASTNAME     0
CONTACTFIRSTNAME    0
DEALSIZE            0
dtype: int64

In [73]:
#Fill missing values:
df['STATE'].fillna('Unknown',inplace = True)

C:\Users\gaytr\AppData\Local\Temp\ipykernel_12560\2982424674.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['STATE'].fillna('Unknown',inplace = True)

In [74]:
df['POSTALCODE'].fillna(df['POSTALCODE'].mode()[0],inplace=True)

C:\Users\gaytr\AppData\Local\Temp\ipykernel_12560\798346177.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['POSTALCODE'].fillna(df['POSTALCODE'].mode()[0],inplace=True)

In [75]:
#drop missing values:
df.dropna()
df.dropna(subset=['STATE'])

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,TOTAL_SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,PHONE,ADDRESSLINE1,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2003-02-24,Shipped,1,2,2003,...,2125557818,897 Long Airport Avenue,NYC,NY,10022,USA,CA,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,2003-05-07,Shipped,2,5,2003,...,26.47.1555,59 rue de l'Abbaye,Reims,CA,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,2003-07-01,Shipped,3,7,2003,...,+33 1 46 62 7555,27 rue du Colonel Pierre Avia,Paris,CA,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,2003-08-25,Shipped,3,8,2003,...,6265557265,78934 Hillside Dr.,Pasadena,CA,90003,USA,CA,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,2003-10-10,Shipped,4,10,2003,...,6505551386,7734 Strong St.,San Francisco,CA,CA,USA,CA,Brown,Julie,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,10350,20,100.00,15,2244.40,2004-12-02,Shipped,4,12,2004,...,(91) 555 94 44,"C/ Moralzarzal, 86",Madrid,CA,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,2005-01-31,Shipped,1,1,2005,...,981-443655,Torikatu 38,Oulu,CA,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,2005-03-01,Resolved,1,3,2005,...,(91) 555 94 44,"C/ Moralzarzal, 86",Madrid,CA,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,2005-03-28,Shipped,1,3,2005,...,61.77.6555,1 rue Alsace-Lorraine,Toulouse,CA,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,2005-05-06,On Hold,2,5,2005,...,6175559555,8616 Spinnaker Dr.,Boston,MA,51003,USA,CA,Yoshido,Juri,Medium

In [76]:
#Sorting
df.sort_values(by = "TOTAL_SALES",ascending = False)
df.sort_values(by = ['YEAR_ID','TOTAL_SALES'])

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,TOTAL_SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,PHONE,ADDRESSLINE1,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
1540,10110,20,35.51,3,710.20,2003-03-18,Shipped,1,3,2003,...,(171) 555-1555,Fauntleroy Circus,Manchester,CA,EC2 5NT,UK,EMEA,Ashworth,Victoria,Small
1794,10135,20,35.87,1,717.40,2003-07-02,Shipped,3,7,2003,...,4155551450,5677 Strong St.,San Rafael,CA,97562,USA,CA,Nelson,Valarie,Small
1717,10114,24,30.06,1,721.44,2003-04-01,Shipped,2,4,2003,...,(1) 42.34.2555,"265, boulevard Charonne",Paris,CA,75012,France,EMEA,Bertrand,Marie,Small
1546,10193,26,29.21,10,759.46,2003-11-21,Shipped,4,11,2003,...,61-9-3844-6555,7 Allen Street,Glen Waverly,Victoria,3150,Australia,APAC,Connery,Sean,Small
1800,10203,21,37.00,2,777.00,2003-12-02,Shipped,4,12,2003,...,(91) 555 94 44,"C/ Moralzarzal, 86",Madrid,CA,28034,Spain,EMEA,Freyre,Diego,Small
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1995,10405,76,100.00,3,11739.70,2005-04-14,Shipped,2,4,2005,...,88.60.1555,"24, place Kluber",Strasbourg,CA,67000,France,EMEA,Citeaux,Frederique,Large
104,10403,66,100.00,9,11886.60,2005-04-08,Shipped,2,4,2005,...,(171) 555-2282,Berkeley Gardens 12 Brewery,Liverpool,CA,WX1 6LT,UK,EMEA,Devon,Elizabeth,Large
1062,10412,60,100.00,9,11887.80,2005-05-03,Shipped,2,5,2005,...,(91) 555 94 44,"C/ Moralzarzal, 86",Madrid,CA,28034,Spain,EMEA,Freyre,Diego,Large
53,10424,50,100.00,6,12001.00,2005-05-31,In Process,2,5,2005,...,(91) 555 94 44,"C/ Moralzarzal, 86",Madrid,CA,28034,Spain,EMEA,Freyre,Diego,Large
598,10407,76,100.00,2,14082.80,2005-04-22,On Hold,2,4,2005,...,4085553659,3086 Ingle Ln.,San Jose,CA,94217,USA,CA,Frick,Sue,Large

In [80]:
#Ranking
df['SALES_RANK'] = df['TOTAL_SALES'].rank(ascending=False)

In [81]:
#GroupBy Operations
#Total sales by country
df.groupby('COUNTRY')['TOTAL_SALES'].sum()

COUNTRY
Australia       630623.10
Austria         202062.53
Belgium         108412.62
Canada          224078.56
Denmark         245637.15
Finland         329581.91
France         1110916.52
Germany         220472.09
Ireland          57756.43
Italy           374674.31
Japan           188167.81
Norway          307463.70
Philippines      94015.73
Singapore       288488.41
Spain          1215686.92
Sweden          210014.21
Switzerland     117713.56
UK              478880.46
USA            3627982.83
Name: TOTAL_SALES, dtype: float64

In [82]:
#sales by year
df.groupby('YEAR_ID')['TOTAL_SALES'].sum()

YEAR_ID
2003    3516979.54
2004    4724162.60
2005    1791486.71
Name: TOTAL_SALES, dtype: float64

In [83]:
#sales by deal size 
df.groupby('DEALSIZE')['TOTAL_SALES'].mean()

DEALSIZE
Large     8293.753248
Medium    4398.433699
Small     2061.682800
Name: TOTAL_SALES, dtype: float64

In [87]:
#Multiple Aggregations
df.groupby('COUNTRY').agg({
    'TOTAL_SALES' : ['sum','mean','max'],
    'QUANTITYORDERED':'sum'
})

            TOTAL_SALES                        QUANTITYORDERED
                    sum         mean       max             sum
COUNTRY
Australia     630623.10  3408.773514   9774.03            6246
Austria       202062.53  3673.864182   9240.00            1974
Belgium       108412.62  3285.230909   6804.63            1074
Canada        224078.56  3201.122286   9064.89            2293
Denmark       245637.15  3899.002381  10468.90            2197
Finland       329581.91  3582.412065  10606.20            3192
France       1110916.52  3537.950701  11739.70           11090
Germany       220472.09  3556.001452   8940.96            2148
Ireland        57756.43  3609.776875   8258.00             490
Italy         374674.31  3315.701858   9160.36            3773
Japan         188167.81  3618.611731  10758.00            1842
Norway        307463.70  3617.220000   8844.12            2842
Philippines    94015.73  3615.989615   7483.98             961
Singapore     288488.41  3651.752025  10993.50            2760
Spain        1215686.92  3554.640117  12001.00           12429
Sweden        210014.21  3684.459825   7209.11            2006
Switzerland   117713.56  3797.211613   6761.60            1078
UK            478880.46  3325.558750  11886.60            5013
USA          3627982.83  3613.528715  14082.80           35659

In [88]:
df['ORDERDATE'].dt.year

0       2003
1       2003
2       2003
3       2003
4       2003
        ...
2818    2004
2819    2005
2820    2005
2821    2005
2822    2005
Name: ORDERDATE, Length: 2823, dtype: int32

In [89]:
df['ORDERDATE'].dt.month

0        2
1        5
2        7
3        8
4       10
        ..
2818    12
2819     1
2820     3
2821     3
2822     5
Name: ORDERDATE, Length: 2823, dtype: int32

In [90]:
df['ORDERDATE'].dt.day

0       24
1        7
2        1
3       25
4       10
        ..
2818     2
2819    31
2820     1
2821    28
2822     6
Name: ORDERDATE, Length: 2823, dtype: int32

In [91]:
#Monthly sales
df.groupby(df['ORDERDATE'].dt.month)['TOTAL_SALES'].sum()

ORDERDATE
1      785874.44
2      810441.90
3      754501.39
4      669390.96
5      923972.56
6      454756.78
7      514875.97
8      659310.57
9      584724.27
10    1121215.22
11    2118885.67
12     634679.12
Name: TOTAL_SALES, dtype: float64

In [92]:
#String operations
df['CITY'].str.upper()

0                 NYC
1               REIMS
2               PARIS
3            PASADENA
4       SAN FRANCISCO
            ...
2818           MADRID
2819             OULU
2820           MADRID
2821         TOULOUSE
2822           BOSTON
Name: CITY, Length: 2823, dtype: object

In [93]:
df['COUNTRY'].str.contains('USA')

0        True
1       False
2       False
3        True
4        True
        ...
2818    False
2819    False
2820    False
2821    False
2822     True
Name: COUNTRY, Length: 2823, dtype: bool

In [94]:
df['CONTACTFIRSTNAME'].str.len()

0       4
1       4
2       6
3       5
4       5
       ..
2818    5
2819    6
2820    5
2821    7
2822    4
Name: CONTACTFIRSTNAME, Length: 2823, dtype: int64

In [97]:
df['COUNTRY'].value_counts()
df['PRODUCTLINE'].value_counts(normalize=True)

PRODUCTLINE
Classic Cars        0.342543
Vintage Cars        0.215019
Motorcycles         0.117251
Planes              0.108395
Trucks and Buses    0.106624
Ships               0.082891
Trains              0.027276
Name: proportion, dtype: float64

In [98]:
df['SALES_CATEGORY'] = df['TOTAL_SALES'].apply(
    lambda x:'High' if x>5000 else 'Low')

In [99]:
#Pivot tables
pd.pivot_table(
    df,
    values = 'TOTAL_SALES',
    index = 'COUNTRY' ,
    columns = 'YEAR_ID',
    aggfunc = 'sum'
)

YEAR_ID            2003        2004       2005
COUNTRY
Australia     253134.45   232396.68  145091.97
Austria        82117.88    51694.39   68250.26
Belgium         3348.46    80024.05   25040.11
Canada         54609.50   135776.09   33692.97
Denmark        99192.72   120431.56   26012.87
Finland       111154.51    91575.69  126851.71
France        312761.42   555198.70  242956.40
Germany        70053.31   150418.78        NaN
Ireland             NaN    57756.43        NaN
Italy         140928.77   192235.60   41509.94
Japan               NaN   149422.47   38745.34
Norway        196532.60   110931.10        NaN
Philippines    78086.98    15928.75        NaN
Singapore     165686.20   116039.03    6763.18
Spain         405343.39   483545.36  326798.17
Sweden         58459.92   119947.57   31606.72
Switzerland         NaN   117713.56        NaN
UK            180421.55   257656.10   40802.81
USA          1305147.88  1685470.69  637364.26

In [100]:
df

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,TOTAL_SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE,SALES_RANK,FULL_NAME,SALES_CATEGORY
0,10107,30,95.70,2,2871.00,2003-02-24,Shipped,1,2,2003,...,NY,10022,USA,CA,Yu,Kwai,Small,1619.0,KwaiYu,Low
1,10121,34,81.35,5,2765.90,2003-05-07,Shipped,2,5,2003,...,CA,51100,France,EMEA,Henriot,Paul,Small,1708.0,PaulHenriot,Low
2,10134,41,94.74,2,3884.34,2003-07-01,Shipped,3,7,2003,...,CA,75508,France,EMEA,Da Cunha,Daniel,Medium,981.0,DanielDa Cunha,Low
3,10145,45,83.26,6,3746.70,2003-08-25,Shipped,3,8,2003,...,CA,90003,USA,CA,Young,Julie,Medium,1060.0,JulieYoung,Low
4,10159,49,100.00,14,5205.27,2003-10-10,Shipped,4,10,2003,...,CA,CA,USA,CA,Brown,Julie,Medium,487.0,JulieBrown,High
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,10350,20,100.00,15,2244.40,2004-12-02,Shipped,4,12,2004,...,CA,28034,Spain,EMEA,Freyre,Diego,Small,2081.0,DiegoFreyre,Low
2819,10373,29,100.00,1,3978.51,2005-01-31,Shipped,1,1,2005,...,CA,90110,Finland,EMEA,Koskitalo,Pirkko,Medium,930.0,PirkkoKoskitalo,Low
2820,10386,43,100.00,4,5417.57,2005-03-01,Resolved,1,3,2005,...,CA,28034,Spain,EMEA,Freyre,Diego,Medium,430.0,DiegoFreyre,High
2821,10397,34,62.24,1,2116.16,2005-03-28,Shipped,1,3,2005,...,CA,31000,France,EMEA,Roulet,Annette,Small,2181.0,AnnetteRoulet,Low
2822,10414,47,65.52,9,3079.44,2005-05-06,On Hold,2,5,2005,...,MA,51003,USA,CA,Yoshido,Juri,Medium,1486.5,JuriYoshido,Low